//
//  main.swift
//  minu
//
//  Created by 노민우 on 2/6/24.
//

import Foundation
/*
 소행성을 연속적으로 나타내는 정수로 구성된 소행성 배열이 제공됩니다.

 각 소행성에 대해 절대값은 크기를 나타내고 부호는 방향을 나타냅니다(양수는 오른쪽, 음수는 왼쪽을 의미). 각 소행성은 같은 속도로 움직입니다.

 모든 충돌 후 소행성의 상태를 알아보세요. 두 소행성이 만나면 작은 소행성이 폭발합니다. 둘 다 같은 크기이면 둘 다 폭발합니다. 같은 방향으로 움직이는 두 소행성은 결코 만날 수 없습니다.

  

 예시 1:

 입력: 소행성 = [5,10,-5]
 출력: [5,10]
 설명: 10과 -5가 충돌하여 10이 됩니다. 5와 10은 절대 충돌하지 않습니다.
 예 2:

 입력: 소행성 = [8,-8]
 출력: []
 설명: 8과 -8이 충돌하여 서로 폭발했다.
 예시 3:

 입력: 소행성 = [10,2,-5]
 출력: [10]
 설명: 2와 -5가 충돌하여 -5가 됩니다. 10과 -5가 충돌하여 10이 됩니다.
  

 제약:

 2 <= 소행성.길이 <= 104
 -1000 <= 소행성[i] <= 1000
 소행성[i] != 0
 */
class Solution {
    func asteroidCollision(_ asteroids: [Int]) -> [Int] {
        
    }
}
